casino/app/User.php

        public static function boot()
        {
            parent::boot();
            self::created(function($model)
            {
                event(new Events\User\Created($model));
                Jobs\UpdateHierarchyUsersCache::dispatch();
                User::where('id', $model->id)->update(['last_daily_entry' => \Carbon\Carbon::now()->subDays(2)]);
            });
            self::saved(function($model)
            {
                User::where('id', $model->id)->update(['username' => Lib\Functions::remove_emoji($model->username)]);
            });
            self::updated(function($model)
            {
                if( $model->refunds <= 0 )
                {
                    User::where('id', $model->id)->update(['refunds' => 0]);
---
update `w_users` set `username` = 'demo', `w_users`.`updated_at` = '2024-03-15 03:13:36' where `id` = 190 and `is_demo_agent` = 0
update `w_users` set `refunds` = 0, `w_users`.`updated_at` = '2024-03-15 03:13:36' where `id` = 190 and `is_demo_agent` = 0